In [1]:
import numpy as np
import pandas as pd
import os

## Groupby and Aggregate function

In [12]:
# dataframe

df_cars = pd.read_csv("Car_sales.csv")
df_cars

,Manufacturer,Model,Sales_in_thousands,__year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,Volvo,V40,3.545,NaN,Passenger,24.40,1.9,160.0,100.5,67.6,176.6,3.042,15.8,25.0,9/21/2011,66.498812
153,Volvo,S70,15.245,NaN,Passenger,27.50,2.4,168.0,104.9,69.3,185.9,3.208,17.9,25.0,11/24/2012,70.654495
154,Volvo,V70,17.531,NaN,Passenger,28.80,2.4,168.0,104.9,69.3,186.2,3.259,17.9,25.0,6/25/2011,71.155978
155,Volvo,C70,3.493,NaN,Passenger,45.50,2.3,236.0,104.9,71.5,185.7,3.601,18.5,23.0,4/26/2011,101.623357
156,Volvo,S80,18.969,NaN,Passenger,36.00,2.9,201.0,109.9,72.1,189.8,3.600,21.1,24.0,11/14/2011,85.735655

In [13]:
# selecting specific columns

df_cars = df_cars[["Manufacturer","Sales_in_thousands","Vehicle_type","Price_in_thousands","Engine_size","Horsepower","Fuel_capacity"]]
df_cars

,Manufacturer,Sales_in_thousands,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
0,Acura,16.919,Passenger,21.50,1.8,140.0,13.2
1,Acura,39.384,Passenger,28.40,3.2,225.0,17.2
2,Acura,14.114,Passenger,NaN,3.2,225.0,17.2
3,Acura,8.588,Passenger,42.00,3.5,210.0,18.0
4,Audi,20.397,Passenger,23.99,1.8,150.0,16.4
...,...,...,...,...,...,...,...
152,Volvo,3.545,Passenger,24.40,1.9,160.0,15.8
153,Volvo,15.245,Passenger,27.50,2.4,168.0,17.9
154,Volvo,17.531,Passenger,28.80,2.4,168.0,17.9
155,Volvo,3.493,Passenger,45.50,2.3,236.0,18.5
156,Volvo,18.969,Passenger,36.00,2.9,201.0,21.1

In [6]:
# calculate number of unique values

df_cars.nunique()

Manufacturer           30
Sales_in_thousands    157
Vehicle_type            2
Price_in_thousands    152
Engine_size            31
Horsepower             66
Fuel_capacity          55
dtype: int64

### agg() and apply() method

In [5]:
# calculate the sum of columns

df_cars.agg("sum")

Manufacturer          AcuraAcuraAcuraAcuraAudiAudiAudiBMWBMWBMWBuick...
Sales_in_thousands                                             8320.698
Vehicle_type          PassengerPassengerPassengerPassengerPassengerP...
Price_in_thousands                                             4245.567
Engine_size                                                       477.5
Horsepower                                                      29008.0
Fuel_capacity                                                    2800.5
dtype: object

In [18]:
# calculate the mean of numeric columns

df_cars.agg("mean",numeric_only=True) 

# numeric_only doesnot support if aggregates over multiple function, eg. df_cars.agg(["mean","count"],numeric_only=True) doesnot works

Sales_in_thousands     52.998076
Price_in_thousands     27.390755
Engine_size             3.060897
Horsepower            185.948718
Fuel_capacity          17.951923
dtype: float64

In [8]:
df_cars.select_dtypes("number").mean()

Sales_in_thousands     52.998076
Price_in_thousands     27.390755
Engine_size             3.060897
Horsepower            185.948718
Fuel_capacity          17.951923
dtype: float64

In [17]:
df_cars.mean(numeric_only=True)

Sales_in_thousands     52.998076
Price_in_thousands     27.390755
Engine_size             3.060897
Horsepower            185.948718
Fuel_capacity          17.951923
dtype: float64

In [9]:
df_cars.select_dtypes("number").agg("mean")

Sales_in_thousands     52.998076
Price_in_thousands     27.390755
Engine_size             3.060897
Horsepower            185.948718
Fuel_capacity          17.951923
dtype: float64

In [16]:
# calculate the mean and count values

df_cars.select_dtypes(include='number').agg(['mean', 'count']) # doesnot shows columns in which any one of the two functions doesnot work

,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
mean,52.998076,27.390755,3.060897,185.948718,17.951923
count,157.000000,155.000000,156.000000,156.000000,156.000000

In [24]:
# another way

df_cars.select_dtypes(include='number').apply(['mean', 'count'])  # doesnot shows columns in which any one of the two functions doesnot work

,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
mean,52.998076,27.390755,3.060897,185.948718,17.951923
count,157.000000,155.000000,156.000000,156.000000,156.000000

In [8]:
df_cars.apply("mean",numeric_only=True)

# numeric_only doesnot support if applies over multiple function, eg. df_cars.apply(["mean","count"],numeric_only=True) doesnot works

Sales_in_thousands     52.998076
Price_in_thousands     27.390755
Engine_size             3.060897
Horsepower            185.948718
Fuel_capacity          17.951923
dtype: float64

In [9]:
df_cars.select_dtypes("number").apply(["mean","count"])

,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
mean,52.998076,27.390755,3.060897,185.948718,17.951923
count,157.000000,155.000000,156.000000,156.000000,156.000000

In [10]:
df_cars.agg({'Manufacturer':['count'],'Vehicle_type':['count']})

#df_cars[['Manufacturer','Vehicle_type']].agg('count')

       Manufacturer  Vehicle_type
count           157           157

In [17]:
df_cars.apply({'Manufacturer':['count'],'Vehicle_type':['count']})

       Manufacturer  Vehicle_type
count           157           157

In [28]:
# different aggregations per column: calculate the sum and mean of 'sales in thousands" and sum and max of 'price in thousands'

df_cars.agg({"Sales_in_thousands":["sum","mean"],"Price_in_thousands":["sum","max"]})

      Sales_in_thousands  Price_in_thousands
sum          8320.698000            4245.567
mean           52.998076                 NaN
max                  NaN              85.500

In [32]:
# aggregate over the columns

df_cars[["Sales_in_thousands","Price_in_thousands"]].agg("sum",axis=1)

0      38.419
1      67.784
2      14.114
3      50.588
4      44.387
        ...
152    27.945
153    42.745
154    46.331
155    48.993
156    54.969
Length: 157, dtype: float64

In [12]:
df_cars[["Sales_in_thousands","Price_in_thousands"]].apply("sum",axis=1)

0      38.419
1      67.784
2      14.114
3      50.588
4      44.387
        ...
152    27.945
153    42.745
154    46.331
155    48.993
156    54.969
Length: 157, dtype: float64

In [11]:
# equivalent to above (but NaN behaves differently in the 3rd row)

df_cars["Sales_in_thousands"] + df_cars["Price_in_thousands"]

0      38.419
1      67.784
2         NaN
3      50.588
4      44.387
        ...
152    27.945
153    42.745
154    46.331
155    48.993
156    54.969
Length: 157, dtype: float64

In [11]:
df = pd.DataFrame({"A":[4,9,16,25],"B":["a","b","c","d"]})
df["A"] = df["A"].agg(np.sqrt)
df

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_7572\4220584158.py:2: FutureWarning: using <ufunc 'sqrt'> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  df["A"] = df["A"].agg(np.sqrt)

     A  B
0  2.0  a
1  3.0  b
2  4.0  c
3  5.0  d

In [13]:
df_cars[["Sales_in_thousands","Price_in_thousands"]].agg(["sum","max"],axis=1)

        sum     max
0    38.419  21.500
1    67.784  39.384
2    14.114  14.114
3    50.588  42.000
4    44.387  23.990
..      ...     ...
152  27.945  24.400
153  42.745  27.500
154  46.331  28.800
155  48.993  45.500
156  54.969  36.000

[157 rows x 2 columns]

In [45]:
# aggregate different functions and rename the index of the resulting dataframe

df_cars.agg(sum_of_sales=("Sales_in_thousands","sum"),
            Total=("Price_in_thousands","sum"))

              Sales_in_thousands  Price_in_thousands
sum_of_sales            8320.698                 NaN
Total                        NaN            4245.567

In [11]:
df_cars.apply(sum_of_sales=("Sales_in_thousands","sum"),
            Total=("Price_in_thousands","sum"))
# doesnot works as apply function expects a function as its first argument not keyword assignments

TypeError: DataFrame.apply() missing 1 required positional argument: 'func'

### The Split-Apply-Combine strategy

In [23]:
# split data into separate groups

passenger_filter = df_cars["Vehicle_type"]=="Passenger"
car_filter = df_cars["Vehicle_type"]=="Car"

In [51]:
# apply an operation

passenger_avg = df_cars[passenger_filter]["Sales_in_thousands"].mean()
car_avg = df_cars[car_filter]["Sales_in_thousands"].mean()

In [61]:
# combine results into a dataframe

pd.DataFrame({"Vehicle_type":["Car","Passenger"],
             "Avg_Sales_in_thousands":[car_avg,passenger_avg]}).set_index("Vehicle_type")

              Avg_Sales_in_thousands
Vehicle_type
Car                        80.622293
Passenger                  43.234345

## groupby()

this is alternative way for the above split-apply-combine strategy

In [59]:
# group by vehicle type and calculate the mean

df_cars.groupby("Vehicle_type").mean(numeric_only=True)

,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
Vehicle_type,,,,,
Car,80.622293,26.319975,3.520000,186.400000,21.895000
Passenger,43.234345,27.763200,2.902586,185.793103,16.592241

In [62]:
df_cars.groupby("Vehicle_type", as_index=False).mean(numeric_only=True)

,Vehicle_type,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
0,Car,80.622293,26.319975,3.520000,186.400000,21.895000
1,Passenger,43.234345,27.763200,2.902586,185.793103,16.592241

In [60]:
df_cars.groupby("Vehicle_type").sum()

,Manufacturer,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
Vehicle_type,,,,,,
Car,CadillacChryslerDodgeDodgeDodgeDodgeDodgeDodge...,3305.514,1052.799,140.8,7456.0,875.8
Passenger,AcuraAcuraAcuraAcuraAudiAudiAudiBMWBMWBMWBuick...,5015.184,3192.768,336.7,21552.0,1924.7

In [67]:
df_cars.groupby("Manufacturer")["Engine_size"].mean()

Manufacturer
Acura         2.925000
Audi          2.933333
BMW           2.700000
Buick         3.625000
Cadillac      4.500000
Chevrolet     3.055556
Chrysler      2.783333
Dodge         3.709091
Ford          3.327273
Honda         2.520000
Hyundai       1.966667
Infiniti      3.000000
Jaguar        3.000000
Jeep          3.500000
Lexus         3.616667
Lincoln       4.866667
Mercedes-B    3.422222
Mercury       3.150000
Mitsubishi    2.800000
Nissan        2.914286
Oldsmobile    3.450000
Plymouth      2.475000
Pontiac       3.433333
Porsche       3.166667
Saab          2.150000
Saturn        2.020000
Subaru        2.500000
Toyota        2.622222
Volkswagen    1.966667
Volvo         2.300000
Name: Engine_size, dtype: float64

In [82]:
df_cars.groupby("Manufacturer")[["Engine_size","Horsepower"]].mean()

              Engine_size  Horsepower
Manufacturer
Acura            2.925000  200.000000
Audi             2.933333  220.000000
BMW              2.700000  185.333333
Buick            3.625000  206.250000
Cadillac         4.500000  256.000000
Chevrolet        3.055556  171.111111
Chrysler         2.783333  194.833333
Dodge            3.709091  199.545455
Ford             3.327273  170.090909
Honda            2.520000  160.400000
Hyundai          1.966667  126.666667
Infiniti         3.000000  227.000000
Jaguar           3.000000  240.000000
Jeep             3.500000  168.333333
Lexus            3.616667  245.833333
Lincoln          4.866667  263.333333
Mercedes-B       3.422222  232.222222
Mercury          3.150000  163.833333
Mitsubishi       2.800000  165.142857
Nissan           2.914286  169.000000
Oldsmobile       3.450000  190.000000
Plymouth         2.475000  166.750000
Pontiac          3.433333  185.000000
Porsche          3.166667  272.333333
Saab             2.150000  177.500000
Saturn           2.020000  119.600000
Subaru           2.500000  165.000000
Toyota           2.622222  160.666667
Volkswagen       1.966667  120.833333
Volvo            2.300000  182.166667

In [87]:
df_cars.groupby(["Vehicle_type","Manufacturer"])[["Engine_size","Horsepower"]].mean()

                           Engine_size  Horsepower
Vehicle_type Manufacturer
Car          Cadillac         5.700000  255.000000
             Chrysler              NaN         NaN
             Dodge            3.850000  180.000000
             Ford             3.740000  187.800000
             Honda            2.900000  187.000000
             Jeep             3.500000  168.333333
             Lexus            3.850000  225.000000
             Lincoln          5.400000  300.000000
             Mercedes-B       3.200000  215.000000
             Mercury          3.650000  190.000000
             Mitsubishi       3.250000  186.500000
             Nissan           3.300000  170.000000
             Oldsmobile       3.850000  187.500000
             Plymouth         2.400000  150.000000
             Pontiac          3.400000  185.000000
             Subaru           2.500000  165.000000
             Toyota           2.960000  168.600000
Passenger    Acura            2.925000  200.000000
             Audi             2.933333  220.000000
             BMW              2.700000  185.333333
             Buick            3.625000  206.250000
             Cadillac         4.200000  256.250000
             Chevrolet        3.055556  171.111111
             Chrysler         2.783333  194.833333
             Dodge            3.540000  223.000000
             Ford             2.983333  155.333333
             Honda            1.950000  120.500000
             Hyundai          1.966667  126.666667
             Infiniti         3.000000  227.000000
             Jaguar           3.000000  240.000000
             Lexus            3.500000  256.250000
             Lincoln          4.600000  245.000000
             Mercedes-B       3.450000  234.375000
             Mercury          2.900000  150.750000
             Mitsubishi       2.620000  156.600000
             Nissan           2.400000  167.666667
             Oldsmobile       3.250000  191.250000
             Plymouth         2.500000  172.333333
             Pontiac          3.440000  185.000000
             Porsche          3.166667  272.333333
             Saab             2.150000  177.500000
             Saturn           2.020000  119.600000
             Subaru           2.500000  165.000000
             Toyota           2.200000  150.750000
             Volkswagen       1.966667  120.833333
             Volvo            2.300000  182.166667

In [13]:
df_cars.groupby(["Vehicle_type","Manufacturer"], as_index=False)[["Engine_size","Horsepower"]].mean()

   Vehicle_type Manufacturer  Engine_size  Horsepower
0           Car     Cadillac     5.700000  255.000000
1           Car     Chrysler          NaN         NaN
2           Car        Dodge     3.850000  180.000000
3           Car         Ford     3.740000  187.800000
4           Car        Honda     2.900000  187.000000
5           Car         Jeep     3.500000  168.333333
6           Car        Lexus     3.850000  225.000000
7           Car      Lincoln     5.400000  300.000000
8           Car   Mercedes-B     3.200000  215.000000
9           Car      Mercury     3.650000  190.000000
10          Car   Mitsubishi     3.250000  186.500000
11          Car       Nissan     3.300000  170.000000
12          Car   Oldsmobile     3.850000  187.500000
13          Car     Plymouth     2.400000  150.000000
14          Car      Pontiac     3.400000  185.000000
15          Car       Subaru     2.500000  165.000000
16          Car       Toyota     2.960000  168.600000
17    Passenger        Acura     2.925000  200.000000
18    Passenger         Audi     2.933333  220.000000
19    Passenger          BMW     2.700000  185.333333
20    Passenger        Buick     3.625000  206.250000
21    Passenger     Cadillac     4.200000  256.250000
22    Passenger    Chevrolet     3.055556  171.111111
23    Passenger     Chrysler     2.783333  194.833333
24    Passenger        Dodge     3.540000  223.000000
25    Passenger         Ford     2.983333  155.333333
26    Passenger        Honda     1.950000  120.500000
27    Passenger      Hyundai     1.966667  126.666667
28    Passenger     Infiniti     3.000000  227.000000
29    Passenger       Jaguar     3.000000  240.000000
30    Passenger        Lexus     3.500000  256.250000
31    Passenger      Lincoln     4.600000  245.000000
32    Passenger   Mercedes-B     3.450000  234.375000
33    Passenger      Mercury     2.900000  150.750000
34    Passenger   Mitsubishi     2.620000  156.600000
35    Passenger       Nissan     2.400000  167.666667
36    Passenger   Oldsmobile     3.250000  191.250000
37    Passenger     Plymouth     2.500000  172.333333
38    Passenger      Pontiac     3.440000  185.000000
39    Passenger      Porsche     3.166667  272.333333
40    Passenger         Saab     2.150000  177.500000
41    Passenger       Saturn     2.020000  119.600000
42    Passenger       Subaru     2.500000  165.000000
43    Passenger       Toyota     2.200000  150.750000
44    Passenger   Volkswagen     1.966667  120.833333
45    Passenger        Volvo     2.300000  182.166667

In [76]:
# get a specific group within the manufacturer column

df_cars.groupby("Manufacturer").get_group("Ford")

,Manufacturer,Sales_in_thousands,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
46,Ford,70.227,Passenger,12.070,2.0,110.0,12.7
47,Ford,113.369,Passenger,21.560,3.8,190.0,15.7
48,Ford,35.068,Passenger,17.035,2.5,170.0,15.0
49,Ford,245.815,Passenger,17.885,3.0,155.0,16.0
50,Ford,175.670,Passenger,12.315,2.0,107.0,13.2
51,Ford,63.403,Passenger,22.195,4.6,200.0,19.0
52,Ford,276.747,Car,31.930,4.0,210.0,21.0
53,Ford,155.787,Car,21.410,3.0,150.0,26.0
54,Ford,125.338,Car,36.135,4.6,240.0,26.0
55,Ford,220.650,Car,12.050,2.5,119.0,20.0
56,Ford,540.561,Car,26.935,4.6,220.0,25.1

In [78]:
# group by Manufacturer and get the mean of all numeric columns for group "Ford"

df_cars.groupby("Manufacturer").get_group("Ford").mean(numeric_only=True)

Sales_in_thousands    183.875909
Price_in_thousands     21.047273
Engine_size             3.327273
Horsepower            170.090909
Fuel_capacity          19.063636
dtype: float64

In [19]:
df_cars.groupby(["Vehicle_type","Manufacturer"]).get_group(("Car","Ford"))

,Manufacturer,Sales_in_thousands,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
52,Ford,276.747,Car,31.930,4.0,210.0,21.0
53,Ford,155.787,Car,21.410,3.0,150.0,26.0
54,Ford,125.338,Car,36.135,4.6,240.0,26.0
55,Ford,220.650,Car,12.050,2.5,119.0,20.0
56,Ford,540.561,Car,26.935,4.6,220.0,25.1

In [81]:
# group by Manufacturer and calculate the mean

df_cars.groupby("Manufacturer").mean(numeric_only=True)

,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
Manufacturer,,,,,
Acura,19.751250,30.633333,2.925000,200.000000,16.400000
Audi,13.519000,39.980000,2.933333,220.000000,19.533333
BMW,15.501667,33.096667,2.700000,185.333333,17.233333
Buick,60.504750,26.781250,3.625000,206.250000,17.750000
Cadillac,22.435600,40.254000,4.500000,256.000000,20.800000
Chevrolet,61.596111,20.022778,3.055556,171.111111,15.477778
Chrysler,28.817286,23.430833,2.783333,194.833333,16.483333
Dodge,82.740818,24.213636,3.709091,199.545455,21.581818
Ford,183.875909,21.047273,3.327273,170.090909,19.063636
Honda,118.534800,20.277000,2.520000,160.400000,17.080000
Hyundai,45.775333,12.165667,1.966667,126.666667,14.533333
Infiniti,23.713000,29.465000,3.000000,227.000000,18.500000
Jaguar,15.467000,42.800000,3.000000,240.000000,18.400000
Jeep,97.717667,20.991667,3.500000,168.333333,19.833333
Lexus,17.807167,44.055000,3.616667,245.833333,20.533333
Lincoln,28.544667,41.690000,4.866667,263.333333,23.000000
Mercedes-B,13.013889,52.916667,3.422222,232.222222,18.922222
Mercury,39.666500,20.748333,3.150000,163.833333,17.833333
Mitsubishi,25.842143,22.167429,2.800000,165.142857,18.285714
Nissan,57.090714,22.360714,2.914286,169.000000,18.200000
Oldsmobile,29.831500,25.622833,3.450000,190.000000,18.200000
Plymouth,16.000250,22.642500,2.475000,166.750000,15.125000
Pontiac,61.755667,22.949167,3.433333,185.000000,17.916667
Porsche,4.042667,62.473333,3.166667,272.333333,17.000000
Saab,10.653000,29.610000,2.150000,177.500000,17.700000
Saturn,33.770000,14.271000,2.020000,119.600000,12.500000
Subaru,40.067500,21.395000,2.500000,165.000000,16.400000
Toyota,82.245000,21.982889,2.622222,160.666667,17.766667
Volkswagen,34.868667,17.698333,1.966667,120.833333,14.700000
Volvo,12.623333,30.933333,2.300000,182.166667,17.833333

In [88]:
# group by vehicle type and count values

df_cars.groupby("Vehicle_type").count()

,Manufacturer,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
Vehicle_type,,,,,,
Car,41,41,40,40,40,40
Passenger,116,116,115,116,116,116

In [94]:
# find null values in columns

df_cars.isnull().sum()

Manufacturer          0
Sales_in_thousands    0
Vehicle_type          0
Price_in_thousands    2
Engine_size           1
Horsepower            1
Fuel_capacity         1
dtype: int64

In [19]:
# group by Engine_size and count values including null values

df_cars.groupby("Engine_size",dropna=False).count()

,Manufacturer,Sales_in_thousands,Vehicle_type,Price_in_thousands,Horsepower,Fuel_capacity
Engine_size,,,,,,
1.0,1,1,1,1,1,1
1.5,1,1,1,1,1,1
1.6,1,1,1,1,1,1
1.8,8,8,8,8,8,8
1.9,5,5,5,5,5,5
2.0,17,17,17,17,17,17
2.2,4,4,4,4,4,4
2.3,6,6,6,6,6,6
2.4,11,11,11,11,11,11
2.5,11,11,11,11,11,11
2.7,4,4,4,4,4,4
2.8,3,3,3,3,3,3
2.9,1,1,1,1,1,1
3.0,14,14,14,14,14,14
3.1,4,4,4,4,4,4
3.2,6,6,6,5,6,6
3.3,5,5,5,5,5,5
3.4,7,7,7,7,7,7
3.5,8,8,8,8,8,8
3.8,8,8,8,8,8,8
3.9,2,2,2,2,2,2
4.0,7,7,7,7,7,7
4.2,1,1,1,1,1,1
4.3,2,2,2,2,2,2
4.6,9,9,9,9,9,9
4.7,2,2,2,2,2,2
5.0,2,2,2,2,2,2
5.2,2,2,2,2,2,2
5.4,1,1,1,1,1,1
5.7,2,2,2,2,2,2
8.0,1,1,1,1,1,1
NaN,1,1,1,0,0,0

## groupby() and agg() functions together

In [31]:
# find the minimum and maximum values on each column

df_cars.groupby("Vehicle_type").agg(["min","max"])

             Manufacturer         Sales_in_thousands           \
                      min     max                min      max
Vehicle_type
Car              Cadillac  Toyota              9.126  540.561
Passenger           Acura   Volvo              0.110  247.994

             Price_in_thousands         Engine_size      Horsepower         \
                            min     max         min  max        min    max
Vehicle_type
Car                      11.528  60.105         2.0  5.7      119.0  300.0
Passenger                 9.235  85.500         1.0  8.0       55.0  450.0

             Fuel_capacity
                       min   max
Vehicle_type
Car                   15.1  32.0
Passenger             10.3  23.7

In [108]:
df_cars.groupby("Vehicle_type")[["Sales_in_thousands","Price_in_thousands","Engine_size","Horsepower","Fuel_capacity"]].agg(["sum","mean"])

             Sales_in_thousands            Price_in_thousands             \
                            sum       mean                sum       mean
Vehicle_type
Car                    3305.514  80.622293           1052.799  26.319975
Passenger              5015.184  43.234345           3192.768  27.763200

             Engine_size           Horsepower             Fuel_capacity  \
                     sum      mean        sum        mean           sum
Vehicle_type
Car                140.8  3.520000     7456.0  186.400000         875.8
Passenger          336.7  2.902586    21552.0  185.793103        1924.7


                   mean
Vehicle_type
Car           21.895000
Passenger     16.592241

In [36]:
numerical_cols = df_cars.select_dtypes("number").columns
df_cars.groupby("Vehicle_type")[numerical_cols].agg(["sum","mean"])

             Sales_in_thousands            Price_in_thousands             \
                            sum       mean                sum       mean
Vehicle_type
Car                    3305.514  80.622293           1052.799  26.319975
Passenger              5015.184  43.234345           3192.768  27.763200

             Engine_size           Horsepower             Fuel_capacity  \
                     sum      mean        sum        mean           sum
Vehicle_type
Car                140.8  3.520000     7456.0  186.400000         875.8
Passenger          336.7  2.902586    21552.0  185.793103        1924.7


                   mean
Vehicle_type
Car           21.895000
Passenger     16.592241

In [113]:
# set a name for aggregated column and find the min Engine size and max horsepower

df_cars.groupby("Vehicle_type").agg(min_engine_size=("Engine_size","min"),
                                    max_horsepower=("Horsepower","max"))

              min_engine_size  max_horsepower
Vehicle_type
Car                       2.0           300.0
Passenger                 1.0           450.0

In [120]:
# calculate the sum of sales_in_thousands and mean of price_in_thousands

df_cars.groupby("Manufacturer").agg(sum_sales=("Sales_in_thousands","sum"),mean_price=("Price_in_thousands","mean"))

              sum_sales  mean_price
Manufacturer
Acura            79.005   30.633333
Audi             40.557   39.980000
BMW              46.505   33.096667
Buick           242.019   26.781250
Cadillac        112.178   40.254000
Chevrolet       554.365   20.022778
Chrysler        201.721   23.430833
Dodge           910.149   24.213636
Ford           2022.635   21.047273
Honda           592.674   20.277000
Hyundai         137.326   12.165667
Infiniti         23.713   29.465000
Jaguar           15.467   42.800000
Jeep            293.153   20.991667
Lexus           106.843   44.055000
Lincoln          85.634   41.690000
Mercedes-B      117.125   52.916667
Mercury         237.999   20.748333
Mitsubishi      180.895   22.167429
Nissan          399.635   22.360714
Oldsmobile      178.989   25.622833
Plymouth         64.001   22.642500
Pontiac         370.534   22.949167
Porsche          12.128   62.473333
Saab             21.306   29.610000
Saturn          168.850   14.271000
Subaru           80.135   21.395000
Toyota          740.205   21.982889
Volkswagen      209.212   17.698333
Volvo            75.740   30.933333

In [21]:
# Alternate way for the above example without using agg function

sum_sales = df_cars.groupby("Manufacturer").sum()["Sales_in_thousands"]
mean_price = df_cars.groupby("Manufacturer").mean(numeric_only=True)["Price_in_thousands"]
df_Manufacturer = pd.DataFrame([sum_sales,mean_price])
df_Manufacturer = df_Manufacturer.T
df_Manufacturer

              Sales_in_thousands  Price_in_thousands
Manufacturer
Acura                     79.005           30.633333
Audi                      40.557           39.980000
BMW                       46.505           33.096667
Buick                    242.019           26.781250
Cadillac                 112.178           40.254000
Chevrolet                554.365           20.022778
Chrysler                 201.721           23.430833
Dodge                    910.149           24.213636
Ford                    2022.635           21.047273
Honda                    592.674           20.277000
Hyundai                  137.326           12.165667
Infiniti                  23.713           29.465000
Jaguar                    15.467           42.800000
Jeep                     293.153           20.991667
Lexus                    106.843           44.055000
Lincoln                   85.634           41.690000
Mercedes-B               117.125           52.916667
Mercury                  237.999           20.748333
Mitsubishi               180.895           22.167429
Nissan                   399.635           22.360714
Oldsmobile               178.989           25.622833
Plymouth                  64.001           22.642500
Pontiac                  370.534           22.949167
Porsche                   12.128           62.473333
Saab                      21.306           29.610000
Saturn                   168.850           14.271000
Subaru                    80.135           21.395000
Toyota                   740.205           21.982889
Volkswagen               209.212           17.698333
Volvo                     75.740           30.933333

In [24]:
sum_sales = df_cars.groupby("Manufacturer")["Sales_in_thousands"].sum()
mean_price = df_cars.groupby("Manufacturer")["Price_in_thousands"].mean()
df_Manufacturer = pd.DataFrame([sum_sales,mean_price])
df_Manufacturer = df_Manufacturer.T
df_Manufacturer

              Sales_in_thousands  Price_in_thousands
Manufacturer
Acura                     79.005           30.633333
Audi                      40.557           39.980000
BMW                       46.505           33.096667
Buick                    242.019           26.781250
Cadillac                 112.178           40.254000
Chevrolet                554.365           20.022778
Chrysler                 201.721           23.430833
Dodge                    910.149           24.213636
Ford                    2022.635           21.047273
Honda                    592.674           20.277000
Hyundai                  137.326           12.165667
Infiniti                  23.713           29.465000
Jaguar                    15.467           42.800000
Jeep                     293.153           20.991667
Lexus                    106.843           44.055000
Lincoln                   85.634           41.690000
Mercedes-B               117.125           52.916667
Mercury                  237.999           20.748333
Mitsubishi               180.895           22.167429
Nissan                   399.635           22.360714
Oldsmobile               178.989           25.622833
Plymouth                  64.001           22.642500
Pontiac                  370.534           22.949167
Porsche                   12.128           62.473333
Saab                      21.306           29.610000
Saturn                   168.850           14.271000
Subaru                    80.135           21.395000
Toyota                   740.205           21.982889
Volkswagen               209.212           17.698333
Volvo                     75.740           30.933333

## groupby with lambda function

In [29]:
# get actual sales and price values

df_cars.groupby("Manufacturer").sum().agg(lambda X:X*1000)[["Sales_in_thousands","Price_in_thousands"]]

              Sales_in_thousands  Price_in_thousands
Manufacturer
Acura                    79005.0             91900.0
Audi                     40557.0            119940.0
BMW                      46505.0             99290.0
Buick                   242019.0            107125.0
Cadillac                112178.0            201270.0
Chevrolet               554365.0            180205.0
Chrysler                201721.0            140585.0
Dodge                   910149.0            266350.0
Ford                   2022635.0            231520.0
Honda                   592674.0            101385.0
Hyundai                 137326.0             36497.0
Infiniti                 23713.0             29465.0
Jaguar                   15467.0             42800.0
Jeep                    293153.0             62975.0
Lexus                   106843.0            264330.0
Lincoln                  85634.0            125070.0
Mercedes-B              117125.0            476250.0
Mercury                 237999.0            124490.0
Mitsubishi              180895.0            155172.0
Nissan                  399635.0            156525.0
Oldsmobile              178989.0            153737.0
Plymouth                 64001.0             90570.0
Pontiac                 370534.0            137695.0
Porsche                  12128.0            187420.0
Saab                     21306.0             59220.0
Saturn                  168850.0             71355.0
Subaru                   80135.0             42790.0
Toyota                  740205.0            197846.0
Volkswagen              209212.0            106190.0
Volvo                    75740.0            185600.0

In [51]:
# substract values from the mean of each group

df_cars.groupby("Manufacturer").apply(lambda X:X-X.mean(numeric_only=True))

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_1128\69106004.py:3: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df_cars.groupby("Manufacturer").apply(lambda X:X-X.mean(numeric_only=True))

                  Engine_size  Fuel_capacity  Horsepower Manufacturer  \
Manufacturer
Acura        0      -1.125000      -3.200000  -60.000000          NaN
             1       0.275000       0.800000   25.000000          NaN
             2       0.275000       0.800000   25.000000          NaN
             3       0.575000       1.600000   10.000000          NaN
Audi         4      -1.133333      -3.133333  -70.000000          NaN
...                       ...            ...         ...          ...
Volvo        152    -0.400000      -2.033333  -22.166667          NaN
             153     0.100000       0.066667  -14.166667          NaN
             154     0.100000       0.066667  -14.166667          NaN
             155     0.000000       0.666667   53.833333          NaN
             156     0.600000       3.266667   18.833333          NaN

                  Price_in_thousands  Sales_in_thousands Vehicle_type
Manufacturer
Acura        0             -9.133333           -2.832250          NaN
             1             -2.233333           19.632750          NaN
             2                   NaN           -5.637250          NaN
             3             11.366667          -11.163250          NaN
Audi         4            -15.990000            6.878000          NaN
...                              ...                 ...          ...
Volvo        152           -6.533333           -9.078333          NaN
             153           -3.433333            2.621667          NaN
             154           -2.133333            4.907667          NaN
             155           14.566667           -9.130333          NaN
             156            5.066667            6.345667          NaN

[157 rows x 7 columns]

In [134]:
df_cars.groupby("Manufacturer").mean(numeric_only=True)

,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
Manufacturer,,,,,
Acura,19.751250,30.633333,2.925000,200.000000,16.400000
Audi,13.519000,39.980000,2.933333,220.000000,19.533333
BMW,15.501667,33.096667,2.700000,185.333333,17.233333
Buick,60.504750,26.781250,3.625000,206.250000,17.750000
Cadillac,22.435600,40.254000,4.500000,256.000000,20.800000
Chevrolet,61.596111,20.022778,3.055556,171.111111,15.477778
Chrysler,28.817286,23.430833,2.783333,194.833333,16.483333
Dodge,82.740818,24.213636,3.709091,199.545455,21.581818
Ford,183.875909,21.047273,3.327273,170.090909,19.063636
Honda,118.534800,20.277000,2.520000,160.400000,17.080000
Hyundai,45.775333,12.165667,1.966667,126.666667,14.533333
Infiniti,23.713000,29.465000,3.000000,227.000000,18.500000
Jaguar,15.467000,42.800000,3.000000,240.000000,18.400000
Jeep,97.717667,20.991667,3.500000,168.333333,19.833333
Lexus,17.807167,44.055000,3.616667,245.833333,20.533333
Lincoln,28.544667,41.690000,4.866667,263.333333,23.000000
Mercedes-B,13.013889,52.916667,3.422222,232.222222,18.922222
Mercury,39.666500,20.748333,3.150000,163.833333,17.833333
Mitsubishi,25.842143,22.167429,2.800000,165.142857,18.285714
Nissan,57.090714,22.360714,2.914286,169.000000,18.200000
Oldsmobile,29.831500,25.622833,3.450000,190.000000,18.200000
Plymouth,16.000250,22.642500,2.475000,166.750000,15.125000
Pontiac,61.755667,22.949167,3.433333,185.000000,17.916667
Porsche,4.042667,62.473333,3.166667,272.333333,17.000000
Saab,10.653000,29.610000,2.150000,177.500000,17.700000
Saturn,33.770000,14.271000,2.020000,119.600000,12.500000
Subaru,40.067500,21.395000,2.500000,165.000000,16.400000
Toyota,82.245000,21.982889,2.622222,160.666667,17.766667
Volkswagen,34.868667,17.698333,1.966667,120.833333,14.700000
Volvo,12.623333,30.933333,2.300000,182.166667,17.833333

## filtering groups with filter()

In [32]:
def filter_num(x):
    return x>52

filter_num(58)

True

In [54]:
# filter manufacturers out based on sum() and return a subset

def filter_func(x):
    """ x is the dataset"""
    return (x["Sales_in_thousands"].sum() > 52)

df_filter = df_cars.groupby(["Manufacturer"]).filter(filter_func)
df_filter

,Manufacturer,Sales_in_thousands,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
0,Acura,16.919,Passenger,21.500,1.8,140.0,13.2
1,Acura,39.384,Passenger,28.400,3.2,225.0,17.2
2,Acura,14.114,Passenger,NaN,3.2,225.0,17.2
3,Acura,8.588,Passenger,42.000,3.5,210.0,18.0
10,Buick,91.561,Passenger,21.975,3.1,175.0,17.5
...,...,...,...,...,...,...,...
152,Volvo,3.545,Passenger,24.400,1.9,160.0,15.8
153,Volvo,15.245,Passenger,27.500,2.4,168.0,17.9
154,Volvo,17.531,Passenger,28.800,2.4,168.0,17.9
155,Volvo,3.493,Passenger,45.500,2.3,236.0,18.5
156,Volvo,18.969,Passenger,36.000,2.9,201.0,21.1

In [168]:
# # manufacturers with sum of sales more than 52

df_filter.groupby(["Manufacturer"])["Sales_in_thousands"].sum()

Manufacturer
Acura           79.005
Buick          242.019
Cadillac       112.178
Chevrolet      554.365
Chrysler       201.721
Dodge          910.149
Ford          2022.635
Honda          592.674
Hyundai        137.326
Jeep           293.153
Lexus          106.843
Lincoln         85.634
Mercedes-B     117.125
Mercury        237.999
Mitsubishi     180.895
Nissan         399.635
Oldsmobile     178.989
Plymouth        64.001
Pontiac        370.534
Saturn         168.850
Subaru          80.135
Toyota         740.205
Volkswagen     209.212
Volvo           75.740
Name: Sales_in_thousands, dtype: float64

In [163]:
# manufacturers with sum of sales less than 52

df_cars.groupby(["Manufacturer"]).sum()["Sales_in_thousands"].sort_values().head(6)

Manufacturer
Porsche     12.128
Jaguar      15.467
Saab        21.306
Infiniti    23.713
Audi        40.557
BMW         46.505
Name: Sales_in_thousands, dtype: float64

In [178]:
df_removed = df_cars[df_cars["Manufacturer"].isin(["Porsche","Jaguar","Saab","Infiniti","Audi","BMW"])]
df_removed

,Manufacturer,Model,Sales_in_thousands,__year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
4,Audi,A4,20.397,22.255,Passenger,23.990,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639
5,Audi,A6,18.780,23.555,Passenger,33.950,2.8,200.0,108.7,76.1,192.0,3.561,18.5,22.0,8/9/2011,84.565105
6,Audi,A8,1.380,39.000,Passenger,62.000,4.2,310.0,113.0,74.0,198.2,3.902,23.7,21.0,2/27/2012,134.656858
7,BMW,323i,19.747,NaN,Passenger,26.990,2.5,170.0,107.3,68.4,176.0,3.179,16.6,26.0,6/28/2011,71.191207
8,BMW,328i,9.231,28.675,Passenger,33.400,2.8,193.0,107.3,68.5,176.0,3.197,16.6,24.0,1/29/2012,81.877069
9,BMW,528i,17.527,36.125,Passenger,38.900,2.8,193.0,111.4,70.9,188.0,3.472,18.5,25.0,4/4/2011,83.998724
65,Infiniti,I30,23.713,19.690,Passenger,29.465,3.0,227.0,108.3,70.2,193.7,3.342,18.5,25.0,4/15/2012,92.436889
66,Jaguar,S-Type,15.467,NaN,Passenger,42.800,3.0,240.0,114.5,71.6,191.3,3.650,18.4,21.0,11/3/2012,102.178985
124,Porsche,Boxter,8.982,41.250,Passenger,41.430,2.7,217.0,95.2,70.1,171.0,2.778,17.0,22.0,2/19/2012,93.437331
125,Porsche,Carrera Coupe,1.280,60.625,Passenger,71.020,3.4,300.0,92.6,69.5,174.5,3.032,17.0,21.0,12/21/2012,134.390975
126,Porsche,Carrera Cabrio,1.866,67.550,Passenger,74.970,3.4,300.0,92.6,69.5,174.5,3.075,17.0,23.0,7/11/2011,135.914710
127,Saab,5-Sep,9.191,NaN,Passenger,33.120,2.3,170.0,106.4,70.6,189.2,3.280,18.5,23.0,11/9/2012,73.503778
128,Saab,3-Sep,12.115,NaN,Passenger,26.100,2.0,185.0,102.6,67.4,182.2,2.990,16.9,23.0,6/12/2011,76.023048

In [179]:
# tallying the no of rows filtered out and that remains

print(df_removed.shape)
print(df_cars.shape)
print(df_filter.shape)

(13, 16)
(157, 16)
(144, 16)